In [1]:
import pandas as pd

<ipython-input-1-7dd3504c366f>:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
print (pd.__version__)

2.2.0

In [82]:
#Creating the dictionary x

x = {'Name': ['Greg', 'Albott', 'Lex', 'Friedman', 'Jordan', 'Peterson'], 'ID': [1,2,3,4,5,6], 'Group': ['Software', 'Hardware', 'Finance', 'Temp services', 'Operations', 'Sales'],
       'Salary': [10000, 20000, 30000, 40000, 50000,60000]}

#Casting to a dataframe

df = pd.DataFrame(x)
    
df

       Name  ID          Group  Salary
0      Greg   1       Software   10000
1    Albott   2       Hardware   20000
2       Lex   3        Finance   30000
3  Friedman   4  Temp services   40000
4    Jordan   5     Operations   50000
5  Peterson   6          Sales   60000

In [12]:
x

{'Name': ['Greg', 'Albott', 'Lex', 'Friedman', 'Jordan', 'Peterson'],
 'ID': [1, 2, 3, 4, 5, 6],
 'Group': ['Software',
  'Hardware',
  'Finance',
  'Temp services',
  'Operations',
  'Sales'],
 'Salary': [10000, 20000, 30000, 40000, 50000, 60000]}

In [17]:
x=  df[['ID']]
x

   ID
0   1
1   2
2   3
3   4
4   5
5   6

In [18]:
type(x)

pandas.core.frame.DataFrame

In [22]:
z = df[['ID', 'Group', 'Salary']]
z

   ID          Group  Salary
0   1       Software   10000
1   2       Hardware   20000
2   3        Finance   30000
3   4  Temp services   40000
4   5     Operations   50000
5   6          Sales   60000

In [139]:
#Labs Exercise

data = {'Name': ['David', 'Samuel','Terry', 'Evans'], 'Age': [27,24,22,32], 'Country': ['UK', 'Canada', 'China', 'USA'], 
'Course': ['Python', 'Data Structures', 'Machine Learning', 'Web Development'], 'Marks': [85,72,89,76]}

df = pd.DataFrame(data)
df

     Name  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3   Evans   32     USA   Web Development     76

In [24]:
b = df[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

In [25]:
c= df[['Country', 'Course']]

In [84]:
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [85]:
d = df['Name']
d

0     David
1    Samuel
2     Terry
3     Evans
Name: Name, dtype: object

In [28]:
type(d)

pandas.core.series.Series

In [86]:

df.iloc[0,3]

'Python'

In [55]:
df.loc[3, 'Country']

'USA'

In [140]:
df

     Name  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3   Evans   32     USA   Web Development     76

In [142]:
df2 = df.set_index('Name')

In [143]:
df2

        Age Country            Course  Marks
Name
David    27      UK            Python     85
Samuel   24  Canada   Data Structures     72
Terry    22   China  Machine Learning     89
Evans    32     USA   Web Development     76

In [90]:
df2.iloc[0,1]

'UK'

In [65]:
df2.loc['David', 'Marks']

85

In [78]:
df2.head()

        Age Country            Course  Marks
Name
David    27      UK            Python     85
Samuel   24  Canada   Data Structures     72
Terry    22   China  Machine Learning     89
Evans    32     USA   Web Development     76

In [144]:
new_data = pd.DataFrame({

    'Name': ['Jane'],
    'Age' : [30],
    'Country': ['Brazil'],
    'Course': ['Mobile development'],
    'Marks': [90]
})

new_data

   Name  Age Country              Course  Marks
0  Jane   30  Brazil  Mobile development     90

In [145]:
df = pd.concat([df, new_data], ignore_index = True
              )

In [146]:
df

     Name  Age Country              Course  Marks
0   David   27      UK              Python     85
1  Samuel   24  Canada     Data Structures     72
2   Terry   22   China    Machine Learning     89
3   Evans   32     USA     Web Development     76
4    Jane   30  Brazil  Mobile development     90

In [147]:
df = df.set_index('Name')

In [148]:
df

        Age Country              Course  Marks
Name
David    27      UK              Python     85
Samuel   24  Canada     Data Structures     72
Terry    22   China    Machine Learning     89
Evans    32     USA     Web Development     76
Jane     30  Brazil  Mobile development     90

In [149]:
df

        Age Country              Course  Marks
Name
David    27      UK              Python     85
Samuel   24  Canada     Data Structures     72
Terry    22   China    Machine Learning     89
Evans    32     USA     Web Development     76
Jane     30  Brazil  Mobile development     90

In [119]:
salaries = [1000,2000,3000,40000,5000]

In [150]:
df['Salaries'] = {'Salaries': [100,220,300,400,500] }

In [151]:
df

        Age Country              Course  Marks Salaries
Name
David    27      UK              Python     85      NaN
Samuel   24  Canada     Data Structures     72      NaN
Terry    22   China    Machine Learning     89      NaN
Evans    32     USA     Web Development     76      NaN
Jane     30  Brazil  Mobile development     90      NaN